Locked-Inc/STAR/star-rx72n-firmware/libs/rx_hal/src/rx_lpc.c
/**
 * @file rx_lpc.c
 * @brief Low Power Consumption (LPC) HAL Driver Implementation for RX72N
 *
 * @details
 * Implements the Sleep, Software Standby, and Deep Software Standby mode
 * entry paths plus the OPCCR (Operating Power Control) selector described
 * in the RX72N Hardware Manual Chapter 11.
 *
 * @par Register Write Protocol
 * All writes to SBYCR, OPCCR, RSTCKCR, and DPSBYCR require PRC1 to be
 * unlocked via PRCR (key 0xA5, PRC1=1). The driver unlocks, writes, and
 * re-locks PRCR around every such access. PRCR writes are guarded by
 * `#ifdef __RX__` so host-side unit tests can exercise the driver without
 * hardware-mapped register access.
 *
 * @par Low-Power Entry Instruction
 * All three low-power modes are entered by executing the WAIT instruction
 * on RX. SBYCR.SSBY and DPSBYCR.DPSBY are set beforehand to select which
 * flavour of low power the WAIT enters:
 *
 * @verbatim
 *   SSBY=0, DPSBY=0  -> Sleep (WAIT)
 *   SSBY=1, DPSBY=0  -> Software Standby (WAIT)
 *   SSBY=1, DPSBY=1  -> Deep Software Standby (WAIT)
 * @endverbatim
 *
 * @par NASA Power of 10 Compliance
 * - Rule 1: [OK] No goto/setjmp/recursion
 * - Rule 2: [OK] OPCMTSF poll bounded by k_opcmtsf_poll_max retries
 * - Rule 3: [OK] Zero dynamic allocation (file-scope statics only)
 * - Rule 4: [OK] All functions < 60 lines
 * - Rule 5: [OK] >= 2 pre/post conditions per function
 * - Rule 6: [OK] s_*-prefixed file-scope statics, locals at narrowest scope
 * - Rule 7: [OK] All return values checked or explicitly cast to (void)
 * - Rule 8: [OK] C23 typed enums, preprocessor only for __RX__/UNIT_TEST guards
 * - Rule 9: [OK] Single-level pointers
 * - Rule 10: [OK] Compiles with -Wall -Wextra -Werror
 *
 * @see rx_lpc.h         Public API
 * @see rx72n_lpc_regs.h Register layout and bit definitions
 * @see RX72N Hardware Manual Chapter 11 - Low Power Consumption
 *
 * @author Locked, Inc.
 * @date 2026-04-21
 * @copyright Copyright (c) 2026 Locked Inc.
 * SPDX-License-Identifier: MIT
 * @since Version 1.0.0
 */

#include "rx_lpc.h"

#include <stddef.h>

#include "rx72n_lpc_regs.h"

#ifdef __RX__
#include "rx72n_system_regs.h"
#include "rx_register_protection.h"
#endif

/* =============================================================================
 * Internal Constants
 * =============================================================================
 */

/**
 * @enum rx_lpc_init_state_t
 * @brief Driver initialization tracking
 *
 * @since Version 1.0.0
 */
typedef enum : uint8_t {
  k_lpc_not_initialized = 0, /**< rx_lpc_init() has not been called */
  k_lpc_initialized     = 1, /**< rx_lpc_init() completed successfully */
} rx_lpc_init_state_t;

/**
 * @enum rx_lpc_sbycr_bits_t
 * @brief SBYCR bit definitions (RX72N Manual Section 11.2.1, page 405)
 *
 * @details
 * Only the two bits manipulated by this driver are declared here. Other
 * bits in SBYCR (OPE) are left at their reset values.
 *
 * @since Version 1.0.0
 */
typedef enum : uint16_t {
  k_sbycr_ssby = 0x8000U, /**< Bit 15: Software Standby Select (0=sleep, 1=standby) */
} rx_lpc_sbycr_bits_t;

/**
 * @enum rx_lpc_poll_limits_t
 * @brief Bounded-retry limits for register polls
 *
 * @details
 * OPCCR.OPCMTSF typically clears within a few hundred cycles. 1024 is a
 * generous ceiling that still keeps the poll bounded per NASA Rule 2.
 *
 * @since Version 1.0.0
 */
typedef enum : uint16_t {
  k_opcmtsf_poll_max = 1024U, /**< Max OPCMTSF poll iterations */
} rx_lpc_poll_limits_t;

/* =============================================================================
 * Module State
 * =============================================================================
 */

/** @brief Driver initialization flag */
static rx_lpc_init_state_t s_initialized = k_lpc_not_initialized;

/** @brief Last low-power mode the driver attempted to enter */
static rx_lpc_last_mode_t s_last_mode = k_lpc_mode_none;

/** @brief Latched "last reset was deep-standby wake" flag (set by rx_lpc_init) */
static bool s_was_deep_standby_wake = false;

/** @brief Latched wake flags read from DPSIFR0..DPSIFR3 at init time */
static uint32_t s_latched_wake_flags = 0U;

#ifdef UNIT_TEST
/** @brief Test-injected value for the next init: simulated "was deep-standby wake" */
static bool s_inject_was_wake = false;

/** @brief Test-injected value for the next init: simulated pending DPSIFR bitmask */
static uint32_t s_inject_pending_flags = 0U;
#endif

/* =============================================================================
 * Internal Helpers
 * =============================================================================
 */

/**
 * @brief Translate OPCCR mode enum to OPCM[2:0] field value
 *
 * @details
 * Internal helper. The only caller (rx_lpc_set_operating_power) always
 * passes the address of a stack-local uint8_t, so a NULL @p opcm_bits
 * cannot occur from any public API path. No defensive NULL check is
 * therefore required (NASA Rule 5: validate at boundaries, not inside
 * private helpers).
 *
 *
 *
 * @pre opcm_bits != NULL (enforced by callers)
 * @post *opcm_bits contains one of k_opccr_opcm_* constants on success
 *
 * @since Version 1.0.0
 */
static rx_err_t internal_translate_opcc_mode(rx_lpc_opcc_mode_t mode, uint8_t* opcm_bits)
{
  switch (mode) {
    case k_lpc_opcc_high_speed:
      *opcm_bits = k_opccr_opcm_highspeed;
      return k_rx_ok;
    case k_lpc_opcc_low_speed_1:
      *opcm_bits = k_opccr_opcm_lowspeed1;
      return k_rx_ok;
    case k_lpc_opcc_low_speed_2:
      *opcm_bits = k_opccr_opcm_lowspeed2;
      return k_rx_ok;
    default:
      return k_rx_err_invalid_arg;
  }
}

/**
 * @brief Program DPSIER0..DPSIER3 from the 32-bit wake mask
 *
 * @details
 * Each byte of the mask maps directly to one DPSIER register as described
 * in rx_lpc.h. The NMI bit (DPSIER2.DNMIE) is documented as write-once by
 * the hardware; this driver re-asserts it on every call and the hardware
 * will ignore the redundant writes after the first.
 *
 *
 * @pre dps_regs() returns a valid (hardware or host-mocked) pointer
 * @post DPSIER0..DPSIER3 reflect the enabled wake sources
 *
 * @since Version 1.0.0
 */
/* Only used by the host-build (#else) branch of rx_lpc_enter_deep_software_standby;
 * on RX target the same writes are inlined directly under #ifdef __RX__. Guard
 * the helper definition so the cross-compile build doesn't trip
 * -Werror=unused-function. */
#ifndef __RX__
static void internal_program_wake_enables(uint32_t wake_mask)
{
  (void)wake_mask;
}
#endif

/**
 * @brief Assemble DPSBYCR value for a deep-standby entry
 *
 * @details
 * Internal helper. The only caller (rx_lpc_enter_deep_software_standby)
 * validates @p deep_power against the three defined rx_lpc_deep_power_t
 * enumerators before calling, so the switch does not need a default
 * branch (NASA Rule 5: validate at boundaries, not inside private
 * helpers). The DPSBY bit is always set because this value is only used
 * on the deep-standby entry path.
 *
 *
 *
 * @pre deep_power is one of k_lpc_deep_ram_usb_on / k_lpc_deep_ram_usb_off
 *      / k_lpc_deep_lvd_off (enforced by caller)
 * @post Return value contains at most the bits DEEPCUT[1:0], IOKEEP, DPSBY
 *
 * @since Version 1.0.0
 */
static uint8_t internal_assemble_dpsbycr(rx_lpc_deep_power_t deep_power, bool keep_io)
{
  /* LUT keyed by rx_lpc_deep_power_t enumerator value (0..2). Using a LUT
   * rather than a switch eliminates the synthetic "unreachable default"
   * branch that gcov tracks: once deep_power is pre-validated by the
   * caller, a switch still produces a default fall-through branch that
   * no public API path can execute. The LUT has exactly one branch-free
   * path per input and keeps the function trivially verifiable. */
  static const uint8_t s_deepcut_bits[] = {
    [k_lpc_deep_ram_usb_on]  = k_dpsbycr_deepcut_ram_usb_on,
    [k_lpc_deep_ram_usb_off] = k_dpsbycr_deepcut_ram_usb_off,
    [k_lpc_deep_lvd_off]     = k_dpsbycr_deepcut_lvd_off,
  };

  uint8_t value = s_deepcut_bits[deep_power];
  if (keep_io) {
    value |= k_dpsbycr_iokeep;
  }
  value |= k_dpsbycr_dpsby;
  return value;
}

/* =============================================================================
 * Public API
 * =============================================================================
 */

rx_err_t rx_lpc_init(void)
{
  /* Latch whatever the boot path told us about the previous reset */
#ifdef UNIT_TEST
  s_was_deep_standby_wake = s_inject_was_wake;
  s_latched_wake_flags    = s_inject_pending_flags;
  s_inject_was_wake       = false;
  s_inject_pending_flags  = 0U;
#else
  s_was_deep_standby_wake = false;
  s_latched_wake_flags    = 0U;
#endif

#ifdef __RX__
  /* Read DPSIFR0..DPSIFR3, OR them into the latched flags, then clear them */
  volatile rx_dps_regs_t* dps   = dps_regs();
  uint32_t                flags = 0U;
  flags |= ((uint32_t)dps->dpsifr0) << 0U;
  flags |= ((uint32_t)dps->dpsifr1) << 8U;
  flags |= ((uint32_t)dps->dpsifr2) << 16U;
  flags |= ((uint32_t)dps->dpsifr3) << 24U;
  s_latched_wake_flags |= flags;

  /* Write 0 to each flag register to clear any pending wake bits */
  volatile uint16_t* prcr = prcr_reg();
  *prcr                   = k_rx_prcr_unlock_prc1;
  dps->dpsifr0            = 0U;
  dps->dpsifr1            = 0U;
  dps->dpsifr2            = 0U;
  dps->dpsifr3            = 0U;
  *prcr                   = k_rx_prcr_lock;
#endif

  s_last_mode   = k_lpc_mode_none;
  s_initialized = k_lpc_initialized;
  return k_rx_ok;
}

/**
 * @brief Switch the MCU to a different operating-power-control mode
 *
 * @details
 * Programs the OPCCR register with the OPCM bits derived from the
 * requested mode (high-speed / middle-speed / low-power, etc.).  Performs
 * the standard PRCR.PRC1 unlock-write-lock dance, then bounded-polls the
 * OPCMTSF transition-status flag for completion (max
 * k_opcmtsf_poll_max iterations).  On the unit-test target the register
 * write is skipped.
 *
 * @param[in] mode Requested operating-power mode (high-speed, low-speed-1,
 *                 or low-speed-2).
 *
 * @return rx_err_t Error code.
 * @retval k_rx_ok                  Mode applied; OPCMTSF cleared.
 * @retval k_rx_err_not_initialized rx_lpc_init() has not been called.
 * @retval k_rx_err_invalid_arg     mode is outside rx_lpc_opcc_mode_t.
 * @retval k_rx_err_hw_timeout      OPCMTSF poll exceeded
 *                                  k_opcmtsf_poll_max iterations.
 *
 * @pre rx_lpc_init() previously returned k_rx_ok.
 * @pre mode is a valid value of rx_lpc_opcc_mode_t.
 *
 * @post On k_rx_ok: OPCCR.OPCM == requested mode bits and OPCMTSF == 0
 *       (transition complete).
 * @post On k_rx_err_hw_timeout: OPCMTSF poll exceeded
 *       k_opcmtsf_poll_max iterations; the new mode may or may not be
 *       active depending on hardware state.
 *
 * @note Not thread-safe.  Serialize all rx_lpc_* operations.
 *
 * @see rx_lpc_init()        Required to establish init state.
 * @see rx_lpc_enter_sleep() Optional follow-on for low-power entry.
 *
 * @since Version 1.0.0
 */
rx_err_t rx_lpc_set_operating_power(rx_lpc_opcc_mode_t mode)
{
  if (s_initialized != k_lpc_initialized) {
    return k_rx_err_not_initialized;
  }

  uint8_t  opcm_bits = 0U;
  rx_err_t err       = internal_translate_opcc_mode(mode, &opcm_bits);
  if (err != k_rx_ok) {
    return err;
  }

#ifdef __RX__
  volatile uint16_t* prcr = prcr_reg();
  volatile uint8_t*  ocr  = opccr_reg();

  *prcr = k_rx_prcr_unlock_prc1;
  *ocr  = opcm_bits;
  *prcr = k_rx_prcr_lock;

  /* Bounded poll for OPCMTSF=0 (Manual 11.2.6, page 414) */
  for (uint16_t i = 0U; i < k_opcmtsf_poll_max; i++) {
    if ((*ocr & k_opccr_opcmtsf) == 0U) {
      return k_rx_ok;
    }
  }
  return k_rx_err_hw_timeout;
#else
  (void)opcm_bits;
  return k_rx_ok;
#endif
}

/**
 * @brief Enter Sleep low-power mode (CPU stopped, peripherals running)
 *
 * @details
 * Configures SBYCR for Sleep mode (SSBY=0) under PRCR.PRC1 protection,
 * then issues a WAIT instruction to halt the CPU.  Peripheral clocks
 * continue running, so any enabled interrupt resumes execution at the
 * instruction following WAIT.  Records the last entered mode for
 * post-mortem diagnostics.  On the unit-test target the WAIT is skipped.
 *
 * @return rx_err_t Error code.
 * @retval k_rx_ok                  Returned after wake interrupt resumed
 *                                  execution.
 * @retval k_rx_err_not_initialized rx_lpc_init() has not been called.
 *
 * @pre rx_lpc_init() previously returned k_rx_ok.
 * @pre At least one wake source (peripheral interrupt) is configured.
 *
 * @post On wake: s_last_mode == k_lpc_mode_sleep; control returns to the
 *       caller after the wake interrupt's ISR completes.
 * @post On k_rx_err_not_initialized: no register writes performed.
 *
 * @note Not thread-safe.  Serialize all rx_lpc_* operations.
 *
 * @see rx_lpc_enter_software_standby() Deeper sleep with peripherals off.
 *
 * @since Version 1.0.0
 */
rx_err_t rx_lpc_enter_sleep(void)
{
  if (s_initialized != k_lpc_initialized) {
    return k_rx_err_not_initialized;
  }

#ifdef __RX__
  volatile uint16_t*         prcr = prcr_reg();
  volatile rx_system_regs_t* sys  = system_regs();

  *prcr      = k_rx_prcr_unlock_prc1;
  sys->sbycr = (uint16_t)(sys->sbycr & (uint16_t)~k_sbycr_ssby);
  *prcr      = k_rx_prcr_lock;
#endif

  s_last_mode = k_lpc_mode_sleep;

#ifdef __RX__
  __asm__ volatile("wait");
#endif

  return k_rx_ok;
}

/**
 * @brief Enter Software Standby mode (CPU and peripherals stopped)
 *
 * @details
 * Configures SBYCR.SSBY=1 and DPSBYCR.DPSBY=0 under PRCR.PRC1 so that the
 * upcoming WAIT instruction enters Software Standby (not Sleep, not Deep
 * Standby).  Most peripheral clocks are gated off; only configured wake
 * sources (level-sensitive IRQ pins, RTC, watchdog) can resume execution.
 * On the unit-test target the WAIT is skipped.
 *
 * @return rx_err_t Error code.
 * @retval k_rx_ok                  Returned after wake interrupt resumed
 *                                  execution.
 * @retval k_rx_err_not_initialized rx_lpc_init() has not been called.
 *
 * @pre rx_lpc_init() previously returned k_rx_ok.
 * @pre At least one wake source (level-sensitive interrupt or RTC) is
 *      configured before entry.
 *
 * @post On wake: s_last_mode == k_lpc_mode_software_standby; control
 *       returns to the caller after the wake interrupt's ISR.
 * @post On k_rx_err_not_initialized: no register writes performed.
 *
 * @note Not thread-safe.  Serialize all rx_lpc_* operations.
 *
 * @see rx_lpc_enter_sleep()                  Lighter sleep mode.
 * @see rx_lpc_enter_deep_software_standby()  Deepest sleep mode.
 *
 * @since Version 1.0.0
 */
rx_err_t rx_lpc_enter_software_standby(void)
{
  if (s_initialized != k_lpc_initialized) {
    return k_rx_err_not_initialized;
  }

#ifdef __RX__
  volatile uint16_t*         prcr = prcr_reg();
  volatile rx_system_regs_t* sys  = system_regs();
  volatile rx_dps_regs_t*    dps  = dps_regs();

  *prcr = k_rx_prcr_unlock_prc1;
  /* Clear DPSBY so WAIT enters software standby, not deep standby */
  dps->dpsbycr = (uint8_t)(dps->dpsbycr & (uint8_t)~k_dpsbycr_dpsby);
  /* Set SSBY so WAIT enters standby, not sleep */
  sys->sbycr = (uint16_t)(sys->sbycr | k_sbycr_ssby);
  *prcr      = k_rx_prcr_lock;
#endif

  s_last_mode = k_lpc_mode_software_standby;

#ifdef __RX__
  __asm__ volatile("wait");
#endif

  return k_rx_ok;
}

rx_err_t
rx_lpc_enter_deep_software_standby(uint32_t wake_mask, rx_lpc_deep_power_t deep_power, bool keep_io)
{
  if (s_initialized != k_lpc_initialized) {
    return k_rx_err_not_initialized;
  }
  if (wake_mask == 0U) {
    return k_rx_err_invalid_arg;
  }
  if ((wake_mask & ~k_lpc_wake_all_mask) != 0U) {
    return k_rx_err_invalid_arg;
  }
  if ((deep_power != k_lpc_deep_ram_usb_on) && (deep_power != k_lpc_deep_ram_usb_off) &&
      (deep_power != k_lpc_deep_lvd_off)) {
    return k_rx_err_invalid_arg;
  }

  const uint8_t dpsbycr_value = internal_assemble_dpsbycr(deep_power, keep_io);

#ifdef __RX__
  volatile uint16_t*         prcr = prcr_reg();
  volatile rx_system_regs_t* sys  = system_regs();
  volatile rx_dps_regs_t*    dps  = dps_regs();

  *prcr = k_rx_prcr_unlock_prc1;

  /* 1. Enable wake sources */
  dps->dpsier0 = (uint8_t)((wake_mask >> 0U) & 0xFFU);
  dps->dpsier1 = (uint8_t)((wake_mask >> 8U) & 0xFFU);
  dps->dpsier2 = (uint8_t)((wake_mask >> 16U) & 0xFFU);
  dps->dpsier3 = (uint8_t)((wake_mask >> 24U) & 0xFFU);

  /* 2. Clear any stale wake flags */
  dps->dpsifr0 = 0U;
  dps->dpsifr1 = 0U;
  dps->dpsifr2 = 0U;
  dps->dpsifr3 = 0U;

  /* 3. Program DPSBYCR (DEEPCUT, IOKEEP, DPSBY=1) */
  dps->dpsbycr = dpsbycr_value;

  /* 4. Set SBYCR.SSBY so WAIT enters standby-family */
  sys->sbycr = (uint16_t)(sys->sbycr | k_sbycr_ssby);

  *prcr = k_rx_prcr_lock;
#else
  (void)dpsbycr_value;
  internal_program_wake_enables(wake_mask);
#endif

  s_last_mode = k_lpc_mode_deep_software_standby;

#ifdef __RX__
  __asm__ volatile("wait");
  /* On real hardware, execution never reaches here - wake restarts at reset */
#endif

  return k_rx_ok;
}

/**
 * @brief Report whether the most recent reset was a Deep Standby wake
 *
 * @details
 * Returns the cached s_was_deep_standby_wake flag latched at boot time.
 * Allows application code to distinguish between a power-on reset and a
 * resume from Deep Software Standby and take different paths
 * (e.g., skip full re-initialization when waking).
 *
 * @return true if the most recent reset was a Deep Software Standby wake;
 *         false otherwise (or before rx_lpc_init() ran).
 *
 * @pre None (function is safe to call at any time after init or before).
 *
 * @post No state mutated.
 * @post Return value is stable across multiple calls in the same boot
 *       session.
 *
 * @note Safe from any context including ISR; pure read of static storage.
 *
 * @see rx_lpc_get_wake_flags() Detailed wake-source bitfield.
 *
 * @since Version 1.0.0
 */
bool rx_lpc_was_deep_standby_wake(void)
{
  return s_was_deep_standby_wake;
}

/**
 * @brief Read the latched Deep Software Standby wake-source bitfield
 *
 * @details
 * Copies the cached s_latched_wake_flags into the caller-supplied
 * destination.  The bitfield has one bit per wake source; the layout is
 * defined by rx_lpc_wake_t.  Useful after wake to determine which event
 * resumed execution.
 *
 * @param[out] flags Destination for the latched 32-bit wake-source bitfield.
 *
 * @return rx_err_t Error code.
 * @retval k_rx_ok                  *flags populated with the latched bits.
 * @retval k_rx_err_invalid_arg     flags is NULL.
 * @retval k_rx_err_not_initialized rx_lpc_init() has not been called.
 *
 * @pre rx_lpc_init() previously returned k_rx_ok.
 * @pre flags != NULL.
 *
 * @post On k_rx_ok: *flags holds the latched wake-source bitfield;
 *       internal state unchanged.
 *
 * @note Not safe from ISR (acquires no lock but reads driver state that
 *       could be torn during init).
 *
 * @see rx_lpc_was_deep_standby_wake() Cheap boolean wake-source query.
 *
 * @since Version 1.0.0
 */
rx_err_t rx_lpc_get_wake_flags(uint32_t* flags)
{
  if (flags == NULL) {
    return k_rx_err_invalid_arg;
  }
  if (s_initialized != k_lpc_initialized) {
    return k_rx_err_not_initialized;
  }

  *flags = s_latched_wake_flags;
  return k_rx_ok;
}

/* =============================================================================
 * Test-Only Helpers
 * =============================================================================
 */

#ifdef UNIT_TEST
void rx_lpc_test_reset(void)
{
  s_initialized           = k_lpc_not_initialized;
  s_last_mode             = k_lpc_mode_none;
  s_was_deep_standby_wake = false;
  s_latched_wake_flags    = 0U;
  s_inject_was_wake       = false;
  s_inject_pending_flags  = 0U;
}

rx_lpc_last_mode_t rx_lpc_test_get_last_mode(void)
{
  return s_last_mode;
}

void rx_lpc_test_set_deep_standby_wake(bool was_wake)
{
  s_inject_was_wake = was_wake;
}

void rx_lpc_test_set_pending_wake_flags(uint32_t flags)
{
  s_inject_pending_flags = flags;
}
#endif /* UNIT_TEST */
